<?php
	$res=array(
			"title"=>"我的趋势图",                           #图表名称
			"graph"=>array(
				"0"=>array(                                  #第一条曲线
					"name"=>"line_1",                   #曲线名为“line_name_1”
					"data"=>array(                           
						"2012-03-01"=>"19",			          #曲线数值，为x轴对应y轴值形式
						"2012-03-02"=>"27",
						"2012-03-03"=>35,
						"2012-03-04"=>42,
						"2012-03-05"=>62,
						"2012-03-06"=>32,
						"2012-03-07"=>12,
						)
					),
				"1"=>array(
					"name"=>"line_2",						 #第二条曲线
					"data"=>array(
						"2012-03-01"=>"21",
						"2012-03-02"=>11,
						"2012-03-03"=>32,
						"2012-03-04"=>20,
						"2012-03-05"=>32,
						"2012-03-06"=>41,
						"2012-03-07"=>46,
						)
					)
			)
        );
$data=$res[graph];
foreach($data as $key=>$values){
    echo $data[$key][name]."<br>";
    foreach($data[$key][data] as $key=>$values)
    {
        echo $key.':'.$values.'<br>';
    }
}
?>
